package Kim;

public class Kim0921 {

	public static void main(String[] args) {
		/*1. 다음 결과가 나오도록 프로그램을 구현하시오
		 [결과]
		46
		47 37
		48 38 29
		49 39 30 22
		50 40 31 23 16
		51 41 32 24 17 11
		52 42 33 25 18 12 7
		53 43 34 26 19 13 8 4
		54 44 35 27 20 14 9 5 2
		55 45 36 28 21 15 10 6 3 1
		1.가변 배열 선언
		2.각행의 1차원 배열 객체 생성
		3.배열의 내부에 숫자 채우기
		4.결과 출력*/

		// 2. 숫자를 입력받아 소수인지 판별하는 프로그램 작성하기

		
		//3. 다음 결과가 나오도록 프로그램 작성하시오
	
		/* 동전의 종류가 500, 100, 50, 10, 5, 1 이고,
		* 각각의 동전이 5개가 있다고 가정할때
		지정된 갯수만큼만 동전 변경하고, 변경 후의 남은 동전의 갯수 출력하기
		[결과] 
		금액을 입력하세요
		36000
		동전이 부족합니다.
		금액을 입력하세요
		3010
		500원:5
		100원:5
		50원:0
		10원:1
		5원:0
		1원:0
		남은 동전 500원:0개
		남은 동전 100원:0개
		남은 동전 50원:5개
		남은 동전 10원:4개
		남은 동전 5원:5개
		남은 동전 1원:5개*/

		/*
		4. 강아지, 병아리의 합과 다리수의 합을 입력받아서 
		강아지의 마리수와 병아리의 마리수를 출력하기.
		계산이 안될 경우 정답없음 출력하기
		[결과]
		강아지와 병아리 의 합계를 입력하세요
		10
		강아지와 병아리 의 다리의 합계를 입력하세요
		20
		강아지는0마리이고, 병아리는10마리입니다.*/

	}

}
